export function getZodiac(month, day) {
    // month - точно правильный
    // day - точно правильный
    if (1 === month) {
        if (day < 22) {
            return 'козерог'; // возвращаем значение и "уходим"
        }
        return 'водолей';
    }

    if (2 === month) {
        if (day < 22) {
            return 'водолей'; // возвращаем значение и "уходим"
        }
        return 'рыбы';
    }
    if (3 === month) {
        if (day < 22) {
            return 'рыбы'; // возвращаем значение и "уходим"
        }
        return 'овен';
    }
    if (4 === month) {
        if (day < 22) {
            return 'овен'; // возвращаем значение и "уходим"
        }
        return 'телец';
    }
    if (5 === month) {
        if (day < 22) {
            return 'телец'; // возвращаем значение и "уходим"
        }
        return 'близнецы';
    }
    if (6 === month) {
        if (day < 20) {
            return 'близнецы'; // возвращаем значение и "уходим"
        }
        return 'рак';
    }
    if (7 === month) {
        if (day < 22) {
            return 'рак'; // возвращаем значение и "уходим"
        }
        return 'лев';
    }
    if (8 === month) {
        if (day < 22) {
            return 'лев'; // возвращаем значение и "уходим"
        }
        return 'дева';
    }
    if (9 === month) {
        if (day < 22) {
            return 'дева'; // возвращаем значение и "уходим"
        }
        return 'весы';
    }
    if (10 === month) {
        if (day < 22) {
            return 'весы'; // возвращаем значение и "уходим"
        }
        return 'скорпион';
    }
    if (11 === month) {
        if (day < 22) {
            return 'скорпион'; // возвращаем значение и "уходим"
        }
        return 'стрелец';
    }
    if (12 === month) {
        if (day < 22) {
            return 'стрелец'; // возвращаем значение и "уходим"
        }
        return 'козерог';
    }
}